cfe llm/Enums/AI_РежимВыполненияMCP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РежимВыполненияMCP</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_MCPИнструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_MCPИнструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AI_MCPСерверы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнееИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубличноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходнаяСхема</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходнаяСхема</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннотации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Совместим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаСовместимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбнаружения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_ПрофилиMCP.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ПрофилиMCP</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимумВызовов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийТаймаутСекунд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерРезультатаБайт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.AI_MCPИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимВыполнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_РежимВыполненияMCP</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_MCPРеестрИнструментов/Ext/Module.bsl
Функция ПроверитьПодключение(Знач Сервер) Экспорт

	Результат = AI_MCPКлиент.ПроверитьПодключение(Сервер);
	ОбновитьСостояниеСервера(
		Сервер,
		ПолучитьСвойство(Результат, "ok", Ложь),
		ПолучитьСвойство(Результат, "error", ""),
		Ложь,
		ПолучитьСвойство(Результат, "protocolVersion", ""));
	Возврат Результат;

КонецФункции

Функция Синхронизировать(Знач Сервер) Экспорт

	Попытка
		ИнструментыСервера = AI_MCPКлиент.ПолучитьИнструменты(Сервер);
		НачатьТранзакцию();
		Попытка
			ОбнаруженныеИмена = Новый Соответствие;
			КоличествоСовместимых = 0;
			Для Каждого ДанныеИнструмента Из ИнструментыСервера Цикл
				ВнешнееИмя = СокрЛП(Строка(ПолучитьСвойство(ДанныеИнструмента, "name", "")));
				Если Не ЗначениеЗаполнено(ВнешнееИмя) Тогда
					Продолжить;
				КонецЕсли;
				ОбнаруженныеИмена.Вставить(ВнешнееИмя, Истина);
				Инструмент = НайтиИнструмент(Сервер, ВнешнееИмя);
				НовыйИнструмент = Не ЗначениеЗаполнено(Инструмент);
				Если НовыйИнструмент Тогда
					ОбъектИнструмента = Справочники.AI_MCPИнструменты.СоздатьЭлемент();
					ОбъектИнструмента.Владелец = Сервер;
					ОбъектИнструмента.ПубличноеИмя = СформироватьПубличноеИмя(Сервер, ВнешнееИмя);
					ОбъектИнструмента.Код = ОбъектИнструмента.ПубличноеИмя;
					ОбъектИнструмента.ДатаОбнаружения = ТекущаяДатаСеанса();
				Иначе
					ОбъектИнструмента = Инструмент.ПолучитьОбъект();
				КонецЕсли;

				СхемаВхода = ПолучитьСвойство(
					ДанныеИнструмента,
					"inputSchema",
					НоваяПустаяСхема());
				ПроверкаСхемы = ПроверитьСхему(СхемаВхода);
				Заголовок = ПолучитьСвойство(ДанныеИнструмента, "title", "");
				Если Не ЗначениеЗаполнено(Заголовок) Тогда
					Заголовок = ВнешнееИмя;
				КонецЕсли;

				ОбъектИнструмента.Наименование = Лев(Строка(Заголовок), 150);
				ОбъектИнструмента.ВнешнееИмя = Лев(ВнешнееИмя, 256);
				ОбъектИнструмента.Описание = Лев(
					Строка(ПолучитьСвойство(ДанныеИнструмента, "description", "")),
					5000);
				ОбъектИнструмента.ВходнаяСхема = Новый ХранилищеЗначения(СхемаВхода);
				ОбъектИнструмента.ВыходнаяСхема = Новый ХранилищеЗначения(
					ПолучитьСвойство(ДанныеИнструмента, "outputSchema", Неопределено));
				ОбъектИнструмента.Аннотации = Новый ХранилищеЗначения(
					ПолучитьСвойство(ДанныеИнструмента, "annotations", Неопределено));
				ОбъектИнструмента.ХешСхемы = ХешСтруктуры(ДанныеИнструмента);
				ОбъектИнструмента.Активен = Истина;
				ОбъектИнструмента.Совместим = ПроверкаСхемы.ok;
				ОбъектИнструмента.ОшибкаСовместимости = ПроверкаСхемы.error;
				ОбъектИнструмента.ДатаПроверки = ТекущаяДатаСеанса();
				ОбъектИнструмента.Записать();
				Если ПроверкаСхемы.ok Тогда
					КоличествоСовместимых = КоличествоСовместимых + 1;
				КонецЕсли;
			КонецЦикла;

			ПометитьОтсутствующиеИнструменты(Сервер, ОбнаруженныеИмена);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		ОбновитьСостояниеСервера(Сервер, Истина, "", Истина);
		Возврат Новый Структура(
			"ok,total,compatible",
			Истина,
			ИнструментыСервера.Количество(),
			КоличествоСовместимых);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбновитьСостояниеСервера(Сервер, Ложь, ТекстОшибки);
		Возврат Новый Структура("ok,error", Ложь, ТекстОшибки);
	КонецПопытки;

КонецФункции

Функция ПолучитьОписания(Знач ПрофильMCP, Знач ДляResponses = Ложь) Экспорт

	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(ПрофильMCP) Тогда
		Возврат Результат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		| ИнструментыПрофиля.Инструмент.ПубличноеИмя КАК Имя,
		| ИнструментыПрофиля.Инструмент.Описание КАК Описание,
		| ИнструментыПрофиля.Инструмент.ВходнаяСхема КАК ВходнаяСхема
		|ИЗ
		| Справочник.AI_ПрофилиMCP.Инструменты КАК ИнструментыПрофиля
		|ГДЕ
		| ИнструментыПрофиля.Ссылка = &Профиль
		| И ИнструментыПрофиля.РежимВыполнения = &Автоматически
		| И ИнструментыПрофиля.Инструмент.Активен
		| И ИнструментыПрофиля.Инструмент.Совместим
		| И ИнструментыПрофиля.Инструмент.Владелец.Активен";
	Запрос.УстановитьПараметр("Профиль", ПрофильMCP);
	Запрос.УстановитьПараметр(
		"Автоматически",
		Перечисления.AI_РежимВыполненияMCP.Автоматически);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			Схема = Выборка.ВходнаяСхема.Получить();
		Исключение
			Продолжить;
		КонецПопытки;
		Результат.Добавить(ОписаниеДляМодели(
			Выборка.Имя,
			Выборка.Описание,
			Схема,
			ДляResponses));
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ВыполнитьИнструмент(Знач ПубличноеИмя, Знач Аргументы, Знач ПрофильMCP, Знач Состояние) Экспорт

	Настройки = ПолучитьНастройкиВыполнения(ПубличноеИмя, ПрофильMCP);
	КоличествоВызовов = ПолучитьСвойство(Состояние, "КоличествоВызововMCP", 0);
	Если Настройки.МаксимумВызовов > 0
		И КоличествоВызовов >= Настройки.МаксимумВызовов Тогда
		ВызватьИсключение СтрШаблон(
			"Достигнут лимит вызовов MCP за запуск (%1).",
			Настройки.МаксимумВызовов);
	КонецЕсли;
	УстановитьСвойство(Состояние, "КоличествоВызововMCP", КоличествоВызовов + 1);

	ОтветMCP = AI_MCPКлиент.ВыполнитьИнструмент(
		Настройки.Сервер,
		Настройки.ВнешнееИмя,
		Аргументы,
		Настройки.ОбщийТаймаутСекунд);
	Результат = НормализоватьРезультат(ОтветMCP);
	Размер = ПолучитьДвоичныеДанныеИзСтроки(
		OPI_Инструменты.JSONСтрокой(Результат)).Размер();
	Если Настройки.МаксимальныйРазмерРезультатаБайт > 0
		И Размер > Настройки.МаксимальныйРазмерРезультатаБайт Тогда
		ВызватьИсключение СтрШаблон(
			"Результат MCP-инструмента превышает лимит профиля: %1 из %2 байт.",
			Размер,
			Настройки.МаксимальныйРазмерРезультатаБайт);
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ЭтоИнструментMCP(Знач ПубличноеИмя, Знач ПрофильMCP) Экспорт

	Попытка
		ПолучитьНастройкиВыполнения(ПубличноеИмя, ПрофильMCP);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ПолучитьПрофильАгента(Знач Агент) Экспорт

	Если Не ЗначениеЗаполнено(Агент) Тогда
		Возврат Справочники.AI_ПрофилиMCP.ПустаяСсылка();
	КонецЕсли;
	Возврат Агент.ПрофильMCP;

КонецФункции

Функция НайтиИнструмент(Знач Сервер, Знач ВнешнееИмя)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| AI_MCPИнструменты.Ссылка КАК Ссылка
		|ИЗ
		| Справочник.AI_MCPИнструменты КАК AI_MCPИнструменты
		|ГДЕ
		| AI_MCPИнструменты.Владелец = &Сервер
		| И AI_MCPИнструменты.ВнешнееИмя = &ВнешнееИмя
		| И НЕ AI_MCPИнструменты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Сервер", Сервер);
	Запрос.УстановитьПараметр("ВнешнееИмя", ВнешнееИмя);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.AI_MCPИнструменты.ПустаяСсылка());

КонецФункции

Функция ПолучитьНастройкиВыполнения(Знач ПубличноеИмя, Знач ПрофильMCP)

	Если Не ЗначениеЗаполнено(ПрофильMCP) Тогда
		ВызватьИсключение "Для агента не настроен профиль MCP.";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| ИнструментыПрофиля.Инструмент.Владелец КАК Сервер,
		| ИнструментыПрофиля.Инструмент.ВнешнееИмя КАК ВнешнееИмя,
		| ИнструментыПрофиля.Ссылка.МаксимумВызовов КАК МаксимумВызовов,
		| ИнструментыПрофиля.Ссылка.ОбщийТаймаутСекунд КАК ОбщийТаймаутСекунд,
		| ИнструментыПрофиля.Ссылка.МаксимальныйРазмерРезультатаБайт КАК МаксимальныйРазмерРезультатаБайт
		|ИЗ
		| Справочник.AI_ПрофилиMCP.Инструменты КАК ИнструментыПрофиля
		|ГДЕ
		| ИнструментыПрофиля.Ссылка = &Профиль
		| И ИнструментыПрофиля.РежимВыполнения = &Автоматически
		| И ИнструментыПрофиля.Инструмент.ПубличноеИмя = &Имя
		| И ИнструментыПрофиля.Инструмент.Активен
		| И ИнструментыПрофиля.Инструмент.Совместим
		| И ИнструментыПрофиля.Инструмент.Владелец.Активен";
	Запрос.УстановитьПараметр("Профиль", ПрофильMCP);
	Запрос.УстановитьПараметр("Имя", ПубличноеИмя);
	Запрос.УстановитьПараметр(
		"Автоматически",
		Перечисления.AI_РежимВыполненияMCP.Автоматически);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "MCP-инструмент не разрешен профилем агента: " + ПубличноеИмя;
	КонецЕсли;
	Возврат Новый Структура(
		"Сервер,ВнешнееИмя,МаксимумВызовов,ОбщийТаймаутСекунд,МаксимальныйРазмерРезультатаБайт",
		Выборка.Сервер,
		Выборка.ВнешнееИмя,
		?(Выборка.МаксимумВызовов > 0, Выборка.МаксимумВызовов, 10),
		?(Выборка.ОбщийТаймаутСекунд > 0, Выборка.ОбщийТаймаутСекунд, 120),
		?(Выборка.МаксимальныйРазмерРезультатаБайт > 0,
			Выборка.МаксимальныйРазмерРезультатаБайт,
			1048576));

КонецФункции

Функция НормализоватьРезультат(Знач ОтветMCP)

	ЭтоОшибка = ПолучитьСвойство(ОтветMCP, "isError", Ложь);
	ТекстовыеЧасти = Новый Массив;
	Для Каждого Элемент Из ПолучитьСвойство(ОтветMCP, "content", Новый Массив) Цикл
		ТипКонтента = ПолучитьСвойство(Элемент, "type", "");
		Если ТипКонтента = "text" Тогда
			ТекстовыеЧасти.Добавить(Строка(ПолучитьСвойство(Элемент, "text", "")));
		ИначеЕсли ТипКонтента = "resource_link" Тогда
			ТекстовыеЧасти.Добавить(
				"Ресурс MCP: " + Строка(ПолучитьСвойство(Элемент, "uri", "")));
		Иначе
			ТекстовыеЧасти.Добавить("Контент MCP типа " + ТипКонтента + " не передан модели.");
		КонецЕсли;
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("ok", Не ЭтоОшибка);
	Результат.Вставить("content", СтрСоединить(ТекстовыеЧасти, Символы.ПС));
	СтруктурированныеДанные = ПолучитьСвойство(ОтветMCP, "structuredContent", Неопределено);
	Если СтруктурированныеДанные <> Неопределено Тогда
		Результат.Вставить("structuredContent", СтруктурированныеДанные);
	КонецЕсли;
	Если ЭтоОшибка Тогда
		Результат.Вставить("error", Результат.content);
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ОписаниеДляМодели(Знач Имя, Знач Описание, Знач Схема, Знач ДляResponses)

	Если ДляResponses Тогда
		Результат = Новый Структура;
		Результат.Вставить("type", "function");
		Результат.Вставить("name", Имя);
		Результат.Вставить("description", Описание);
		Результат.Вставить("parameters", Схема);
		Результат.Вставить("strict", Ложь);
		Возврат Результат;
	КонецЕсли;
	ФункцияИнструмента = Новый Структура;
	ФункцияИнструмента.Вставить("name", Имя);
	ФункцияИнструмента.Вставить("description", Описание);
	ФункцияИнструмента.Вставить("parameters", Схема);
	Возврат Новый Структура("type,function", "function", ФункцияИнструмента);

КонецФункции

Функция ПроверитьСхему(Знач Схема)

	ТипСхемы = ПолучитьСвойство(Схема, "type", "object");
	Если ТипСхемы <> "object" Тогда
		Возврат Новый Структура(
			"ok,error",
			Ложь,
			"Корневая inputSchema должна иметь type=object.");
	КонецЕсли;
	ТекстСхемы = OPI_Инструменты.JSONСтрокой(Схема);
	Если ПолучитьДвоичныеДанныеИзСтроки(ТекстСхемы).Размер() > 65536 Тогда
		Возврат Новый Структура("ok,error", Ложь, "inputSchema превышает 64 КБ.");
	КонецЕсли;
	Если СтрНайти(НРег(ТекстСхемы), """$ref""") > 0
		Или СтрНайти(НРег(ТекстСхемы), """$defs""") > 0 Тогда
		Возврат Новый Структура(
			"ok,error",
			Ложь,
			"Ссылочные конструкции $ref/$defs пока не поддерживаются модельными API.");
	КонецЕсли;
	Возврат Новый Структура("ok,error", Истина, "");

КонецФункции

Функция НоваяПустаяСхема()

	Схема = Новый Структура;
	Схема.Вставить("type", "object");
	Схема.Вставить("properties", Новый Соответствие);
	Возврат Схема;

КонецФункции

Функция СформироватьПубличноеИмя(Знач Сервер, Знач ВнешнееИмя)

	КодСервера = БезопасныйФрагментИмени(Сервер.Код, 12);
	ИмяИнструмента = БезопасныйФрагментИмени(ВнешнееИмя, 16);
	Если Не ЗначениеЗаполнено(КодСервера) Тогда
		КодСервера = "srv";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяИнструмента) Тогда
		ИмяИнструмента = "tool";
	КонецЕсли;
	ИсточникХеша = XMLСтрока(Сервер) + "|" + ВнешнееИмя;
	Хеш = Base64Строка(OPI_Криптография.Хеш(
		ПолучитьДвоичныеДанныеИзСтроки(ИсточникХеша),
		ХешФункция.SHA256));
	Хеш = НРег(СтрЗаменить(СтрЗаменить(СтрЗаменить(Хеш, "+", "a"), "/", "b"), "=", ""));
	Возврат Лев("mcp_" + КодСервера + "_" + ИмяИнструмента + "_" + Лев(Хеш, 12), 50);

КонецФункции

Функция БезопасныйФрагментИмени(Знач ИсходнаяСтрока, Знач МаксимальнаяДлина)

	ИсходнаяСтрока = НРег(Строка(ИсходнаяСтрока));
	Результат = "";
	Допустимые = "abcdefghijklmnopqrstuvwxyz0123456789_";
	Для Индекс = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		Символ = Сред(ИсходнаяСтрока, Индекс, 1);
		Если СтрНайти(Допустимые, Символ) > 0 Тогда
			Результат = Результат + Символ;
			Если СтрДлина(Результат) >= МаксимальнаяДлина Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ХешСтруктуры(Знач Данные)

	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(OPI_Инструменты.JSONСтрокой(Данные));
	Возврат Лев(Base64Строка(OPI_Криптография.Хеш(
		ДвоичныеДанные,
		ХешФункция.SHA256)), 64);

КонецФункции

Процедура ПометитьОтсутствующиеИнструменты(Знач Сервер, Знач ОбнаруженныеИмена)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		| AI_MCPИнструменты.Ссылка КАК Ссылка,
		| AI_MCPИнструменты.ВнешнееИмя КАК ВнешнееИмя
		|ИЗ
		| Справочник.AI_MCPИнструменты КАК AI_MCPИнструменты
		|ГДЕ
		| AI_MCPИнструменты.Владелец = &Сервер
		| И НЕ AI_MCPИнструменты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Сервер", Сервер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ОбнаруженныеИмена.Получить(Выборка.ВнешнееИмя) = Неопределено Тогда
			ОбъектИнструмента = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектИнструмента.Активен = Ложь;
			ОбъектИнструмента.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьСостояниеСервера(
		Знач Сервер,
		Знач Успешно,
		Знач ТекстОшибки,
		Знач ЭтоСинхронизация = Ложь,
		Знач ВерсияПротокола = "")

	Если Не ЗначениеЗаполнено(Сервер) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ОбъектСервера = Сервер.ПолучитьОбъект();
		ОбъектСервера.СтатусПодключения = ?(Успешно, "Доступен", "Ошибка");
		ОбъектСервера.ТекстОшибки = Лев(ТекстОшибки, 2000);
		Если ЗначениеЗаполнено(ВерсияПротокола) Тогда
			ОбъектСервера.ВерсияПротокола = ВерсияПротокола;
		КонецЕсли;
		Если Успешно И ЭтоСинхронизация Тогда
			ОбъектСервера.ПоследняяСинхронизация = ТекущаяДатаСеанса();
		КонецЕсли;
		ОбъектСервера.Записать();
	Исключение
		// Диагностическая запись не должна заменять основную ошибку MCP.
	КонецПопытки;

КонецПроцедуры

Процедура УстановитьСвойство(Знач Источник, Знач Имя, Знач Значение)

	Источник.Вставить(Имя, Значение);

КонецПроцедуры

Функция ПолучитьСвойство(Знач Источник, Знач Имя, Знач ПоУмолчанию)

	Если Источник = Неопределено Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Значение = Неопределено;
	Попытка
		Если Источник.Свойство(Имя, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Попытка
		Значение = Источник.Получить(Имя);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат ПоУмолчанию;

КонецФункции
